<?php

use Illuminate\Database\Seeder;

class AboutUsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('about_us')->insert([
            'goal' =>'تزامننا مع رؤية 2030 فإن تنمية المهارات التقنية تعد من اهم المهارات المطلوبة ,ومن منطلق ان الاطفال هم صناع المستقبل وأمل الغد اللذي سوف يزهو ويزدهر وطننا تحت أيديهم فيجب علينا الإستفاده من قدراتهم التقنية وتنميتها بما يعود على المجتمع بالمنفعة.',
            'vision' => 'نسعى لنشر المفاهيم البرمجية والتفكير المنطقي بين أطفالنا.',
            'message' => 'نسعى للمشاركة في المناسبات العامة للتوعية بأهمية تعليم البرمجة للأطفال لتحقيق رؤية المملكة 2030',
        ]);
    }
}
